tutorials/cavitatingFoam/nozzle2D/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

startFrom                  latestTime;
startTime                  0;

stopAt                     endTime;
endTime                    1e-3;

deltaT                     1e-8;

writeControl               adjustableRunTime;

writeInterval              1e-5;

purgeWrite                 0;

writeFormat                ascii;
writePrecision             6;
writeCompression           uncompressed;

timeFormat                 general;

runTimeModifiable          yes;

adjustTimeStep             on;

maxCo                      0.5;
maxAcousticCo              50.0;

// ************************************************************************* //
