tutorials/cavitatingFoam/nozzle2D/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0e-03;

vertices
(
    (0  0      0)
    (4  0      0)
    (5  0      0)
    (10 0      0)

    (0  0.167 -7.2913e-3)
    (4  0.167 -7.2913e-3)
    (5  0.167 -7.2913e-3)
    (10 0.167 -7.2913e-3)

    (0  0.5   -2.183e-2)
    (4  0.5   -2.183e-2)
    (5  0.5   -2.183e-2)
    (10 0.5   -2.183e-2)

    (0  0      0)
    (4  0      0)
    (5  0      0)
    (10 0      0)

    (0  0.167  7.2913e-3)
    (4  0.167  7.2913e-3)
    (5  0.167  7.2913e-3)
    (10 0.167  7.2913e-3)

    (0  0.5    2.183e-2)
    (4  0.5    2.183e-2)
    (5  0.5    2.183e-2)
    (10 0.5    2.183e-2)
);


blocks
(
    // block 0
    hex (0 1 5 4 12 13 17 16)
    (40 10 1)
    (0.167 1 1)

    // block 1
    hex (1 2 6 5 13 14 18 17)
    (30 10 1)
    (1 1 1)

    // block 2
    hex (2 3 7 6 14 15 19 18)
    (50 10 1)
    (6 1 1)

    // block 3
    hex (4 5 9 8 16 17 21 20)
    (40 20 1)
    (0.167 1 1)

    // block 4
    hex (6 7 11 10 18 19 23 22)
    (50 20 1)
    (6 1 1)
);


patches
(
    patch inlet
    (
        (0 12 16 4)
        (4 16 20 8)
    )

    patch outlet
    (
        (3 7 19 15)
        (7 11 23 19)
    )

    wall wall
    (
        (8 20 21 9)
        (5 9 21 17)
        (6 5 17 18)
        (10 6 18 22)
        (11 10 22 23)
    )

    wedge back
    (
        (0 4 5 1)
        (1 5 6 2)
        (2 6 7 3)
        (4 8 9 5)
        (6 10 11 7)
    )

    wedge front
    (
        (12 13 17 16)
        (13 14 18 17)
        (14 15 19 18)
        (16 17 21 20)
        (18 19 23 22)
    )
);


// ************************************************************************* //

